---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.DuctPipeModified
source: html/9c949e78-6455-3d1a-53c2-261be2c7a949.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.DuctPipeModified Property

The duct/pipe has been modified to be in the opposite direction causing the connections to be invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuctPipeModified { get; }
```